content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** LR Parsing
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: lr-parsing
:ID:       e65db97a-5831-419f-b47a-c97df2e8ae31
:END:

LR parsers have been the industry standard for quite some time.  The gnu C compiler
even comes with an LR parser generator (called `bison`, a take-off of an older utility
called `yacc`.  Computer people like puns.).  These parsers are fast and capable, but
to be effective using them you really need to understand how they work.


***  Videos

- [[/videos/lr-parsing][LR Parsing]]
- [[https://mediaspace.illinois.edu/media/t/1_qv5ayqow][Class Session (Spring 2022)]]

*** Further Reading

- [[/handouts/lr-parsing-tables.pdf][LR Parsing Tabels]]


