content/lectures/lr-parsing.md
+++
title = "LR Parsing"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

LR parsers have been the industry standard for quite some time.  The gnu C compiler
even comes with an LR parser generator (called \`bison\`, a take-off of an older utility
called \`yacc\`.  Computer people like puns.).  These parsers are fast and capable, but
to be effective using them you really need to understand how they work.


## Videos {#videos}

-   [LR Parsing](/videos/lr-parsing)
-   [Class Session (Spring 2022)](https://mediaspace.illinois.edu/media/t/1_qv5ayqow)


## Further Reading {#further-reading}

-   [LR Parsing Tabels](/handouts/lr-parsing-tables.pdf)
